#   2. 用while循环打印 1 ~ 20 的整数(可以打印多行)  
i = 1
while i <= 20:
    print(i)
    i+=1
#   3. 用while循环打印 1 ~ 20 的整数，打印在一行显示
#     每个数字之间用一个空格分隔
#      1 2 3 4 5 6 .... 18 19 20
i = 1 
while i<=20:
    print(i,end=" ")
    i+=1
print()
#   4. 用while循环打印 1 ~ 20的整数，每行打印5个，
#      打印4行,如:
#      1 2 3 4 5
#      6 7 8 9 10
i = 1
while i <= 20:
    if i%5==0:
        print("%2d"%i)
    else :
        print("%2d"%i,end=" ")
    i+=1
#   5. 输入一个整数n,打印一个宽度和高度都为n个字符的长方形
#     如:
#       请输入: 4
#     打印:
#       ####
#       #  #
#       #  #
#       ####
#     如:
#       请输入: 6
#     打印:
#       ######
#       #    #
#       #    #
#       #    #
#       #    #
#       ######
n = int(input("请输入一个整数"))
i = 1
print("*"*n)
while i<=n-2:
    print("*"+(n-2)*" "+"*")
    i += 1
if n != 1:
    print("*"*n)
