# # 此示例示意语句

# print("hello world")
# x = 100+200
# print(x)
# # -----------以上是三条语句
# print("Hi , you are wellcome");x = 100+250;print(x)
# # -----------上方习惯不好，不利于阅读
# a = 1+2+3+4+5+3+4+8+2+3\
# +41+4+12+412+3214
# print(a)
# # -----------以上叫显示折行
# x = (1+(2*3+4)
# +4+5+6+8)
# print(x)
# # -----------以上叫隐式折行
# # s = input("请输入您想要去的地方： ")
# print(s)
# print(type(s))
# # ------------input
# print(1,2,3,4,5,sep="@@")
# #-------------sep=""
# print("####",end="hahaha")
# print("1111")
# print("aaaa",end="")#常用于不换行
# #-------------end=""




